{
    "IPN": "IPN",
    "About": "Informazioni",
    "Contact": "Contatti",
    "Join": "Unisciti",
    "IPFS": "IPFS",
    "Install": "Installa",
    "Docs": "Documentazione",
    "Code": "Codice",
    "Community": "Comunità",
    "Ecosystem": "Ecosistema",
    "Roadmap": "Sviluppo",
    "Blog": "Blog",
    "Filecoin": "Filecoin",
    "Paper": "Documento",
    "Examples": "Esempi",
    "Project": "Progetto",
    "Media": "Contenuti",
    "IPFS news, articles, references on the media, presence in conferences and talks, organized by chronological order.": "Novità, articoli, riferimenti dai media, presenza in conferenze e discussioni, organizzato in ordine cronologico.",
    "These are a few simple examples for the first steps exploring IPFS.\nThis list will [grow over time](https://github.com/protocol/ipfs-examples).\nThe examples are viewed through an ipfs-hosted renderer.": [
        "Questi sono semplici esempi per fare i primi passi con IPFS.",
        "Questa lista [crescerà col tempo](https://github.com/protocol/ipfs-examples).",
        "Questi esempi sono visualizzati tramite un applicazione servita via IPFS."
    ],
    "Simple JS Apps": "Semplici App Javascript",
    "API Reference": "Manuale di riferimento dell'API",
    "[Every command](../commands/) usable from the cli is also available through\nthe HTTP API. For example:": "[Ogni comando](../commands/) utilizzabile dalla CLI è a anche disponibile tramite l'API HTTP, ad esempio:",
    "Flags": "Flags",
    "Flags are added through the query string. For example, the `--encoding=json`\nflag is the `&encoding=json` query parameter below:": [
        "Le flag sono specificate tramite la stringa query, ad esempio la flag `--encoding=json`",
        "corrisponde al parametro `&encoding=json`:"
    ],
    "Arguments": "Argomenti",
    "Arguments are added through the special query string key `arg`:": "Gli argomenti sono specificati con la chiave speciale `arg` nella stringa query:",
    "Note that it can be used multiple times to signify multiple arguments:": "Può essere usato più volte per indicare multipli argomenti:",
    "TODO": "Da fare",
    "This page will contain a listing of all commands and query examples.\nIf you're seeing this and you want the api reference faster, let us know or help us out here:": [
        "Questa pagina conterrà una lista di tutti i comandi ed esempi di query.",
        "Se stai leggendo questo e vuoi un manuale per l'API piu velocemente, facci sapere o offri il tuo contributo qui:"
    ],
    "Documentation": "Documentazione",
    "Getting Started": "Primi passi",
    "Command Reference": "Tutti i comandi",
    "These are links to some of the IPFS repositories.": "Questi sono link per alcune delle repository di IPFS:",
    "The original IPFS paper, with the main spec.": "L'originale tesi di IPFS, con la specifica principale del protocollo.",
    "The main, reference implementation.": "L'implementazione di riferimento.",
    "Technical specs for IPFS.": "Specifiche tecniche per IPFS.",
    "A directory of all IPFS repositories. _WIP_": "Indice di tutte le repository di IPFS. __WIP__",
    "The IPFS community maintains the following communication channels:": "La comunità di IPFS utilizza i seguenti canali di comunicazione:",
    "as a landing repository, with links to various other repositories.": "come tabella dei contenuti, con collegamenti alle altre repository.",
    "for issues with getting ipfs up and running.": "per problemi nella configurazione di IPFS.",
    "for the go-ipfs implementation.": "per go-ipfs.",
    "for questions you might have about IPFS.": "per eventuali domande riguardo IPFS.",
    "for live help + some dev discussions": "per avere aiuto e per alcune discussioni degli sviluppatori.",
    "Logs": "Registro eventi",
    "for some news.": "per le ultime novità.",
    "for meta-questions on how we manage our community in general.": "per domande sulla gestione della comunità in generale.",
    "If you haven't done so, [install ipfs](../install).": "se non l'hai ancora fatto, [installa ipfs](../install)",
    "During this tutorial, if you have any questions, feel free to ask them in [ipfs/support](https://github.com/ipfs/support) or in [#ipfs on chat.freenode.net](irc://chat.freenode.net/%23ipfs).": "Durante questo tutorial, se hai alcune domande, puoi chiedere in [ipfs/support](https://github.com/ipfs/support) o in [#ipfs su chat.freenode.net](irc://chat.freenode.net/%23ipfs).",
    "init the repo": "inizializza la repository",
    "`ipfs` uses a global local object repository, added to `~/.ipfs`:": "`ipfs` usa una repository di oggetti globali locale, che si trova in `~/.ipfs`:",
    "Note the hash there may differ. If it does, use the one you got.": "Nota: l'impronta potrebbe differire. Se è così, usa quella che hai ottenuto.",
    "Now, try running:": "Ora, prova ad eseguire:",
    "You should see something like this:": "Dovresti vedere qualcosa di simile a questo:",
    "You can explore other objects in there. In particular, check out `quick-start`:": "Puoi esplorare altri oggetti, in particolare dai un'occhiata a `quick-start`:",
    "Which will walk you through several interesting examples.": "Che ti guiderà attraverso alcuni esempi interessanti.",
    "Going Online": "Andare Online",
    "Once you're ready to take things online, run the daemon in another terminal:": "Quando sei pronto ad andare online, esegui il demone in un'altro terminale:",
    "Wait for all three lines to appear.": "Aspetta che tutte e tre le linee appaiano.",
    "Make note of the tcp ports you get. if they are different, use yours in the commands below.": "Presta attenzione alle porte TCP che ottieni. Se sono diverse, usa le tue nei comandi successivi.",
    "Now, if you're connected to the network,\nyou should be able to see the ipfs addresses of your peers:": [
        "Ora, se sei connesso alla rete,",
        "dovresti poter vedere gli indirizzi IPFS dei tuoi peer:"
    ],
    "Now, you should be able to get objects from the network. Try:": "Ora, dovresti essere in grado di ottenere oggetti dalla rete. Prova:",
    "And, you should be able to give the network objects. Try adding one, and then\nviewing it in your favorite browser:": [
        "Dovresti anche essere in grado di offrire oggetti alla rete. Prova ad aggiungerne uno, e poi",
        "visualizzalo dal tuo browser preferito:"
    ],
    "Cool, huh? The gateway served a file _from your computer_. The gateway queried\nthe DHT, found your machine, requested the file, your machine sent it to the\ngateway, and the gateway sent it to your browser.": [
        "Molto bene! Il gateway ha servito un file _dal tuo computer_. Il gateway ha fatto richiesta",
        "alla DHT, trovato il tuo computer, richiesto il file, il tuo computer lo ha inviato al",
        "gateway, e il gateway lo ha inviato al tuo browser."
    ],
    "Note: depending on the state of the network, the `curl` may take a while. The public gateways may be overloaded or having a hard time reaching you.": "Nota: in base allo stato della rete, il `curl` potrebbe impiegare un po' di tempo. I gateway pubblici potrebbero essere sovraccarichi o non riuscire a raggiungere il tuo computer.",
    "You can also check it out at your own local gateway:": "Puoi anche dare un'occhiata dal tuo gateway locale:",
    "By default, your gateway is not exposed to the world, it only works locally.": "Per impostazione predefinita, il tuo gateway non è esposto al mondo, ma funziona solo localmente.",
    "Fancy Web Console": "Web Console",
    "We also have a web console you can use to check the state of your node.\nOn your favorite web browser, go to:": [
        "Abbiamo anche una Web Console che puoi usare per gestire il tuo nodo.",
        "Sul tuo browser preferito, apri:"
    ],
    "This should bring up a console like this:": "Questo dovrebbe mostrare una console così:",
    "Now, you're ready:": "Ora, sei pronto:",
    "Onward to more Examples": "Verso altri Esempi",
    "Install IPFS": "Installa IPFS",
    "You can install the [Go IPFS implementation](https://github.com/ipfs/go-ipfs)\nfrom source or from prebuilt packages.": [
        "Puoi installare l'[Implementazione in Go](https://github.com/ipfs/go-ipfs)",
        "da sorgente o da pacchetti precompilati."
    ],
    "Prebuilt Packages": "Pacchetti Precompilati",
    "We use [gobuilder.me](https://gobuilder.me) to do automated builds.": "Usiamo  [gobuilder.me](https://gobuilder.me) per automatizzare la compilazione.",
    "Download a binary for your platform (more coming):": "Scarica un binario per la tua piattaforma (altri in arrivo):",
    "See all builds": "Vedi tutte le build",
    "Test it out:": "Provalo:",
    "That's it!": "Questo è tutto!",
    "Getting Started with IPFS": "Primi passi con IPFS",
    "Note: if you're concerned about security, build from source, as either\n[gobuilder.me](https://gobuilder.me) or [github.com](https://github.com)\ncould introduce vulnerabilites. We will be doing signed releases soon.\n[Post here](https://github.com/ipfs/go-ipfs/issues/957) if you'd like this\nsooner.": [
        "Attenzione: se sei preoccupato per la sicurezza, la build dal sorgente, come",
        "[gobuilder.me](https://gobuilder.me) o [github.com](https://github.com),",
        "potrebbe introdurre delle vulnerabilità. Presto rilasceremo delle versioni con firma digitale.",
        "[Scrivi qui](https://github.com/ipfs/go-ipfs/issues/957) se desideri che questo",
        "venga fatto al più presto."
    ],
    "From Source": "Da Sorgente",
    "Dependencies:": "Dipendenze:",
    "[Install Go 1.5](https://golang.org/doc/install) (to compile. [make sure it's 1.5](#check-go-version))": "[Installa Go 1.5](https://golang.org/doc/install) (per compilare. [assicurati che sia 1.5](#check-go-version))",
    "[Install Git](https://git-scm.com/) (to download dependencies)": "[Installa Git](https://git-scm.com/) (per scaricare le dipendenze)",
    "*Optionally*, install [FUSE](#install-fuse) (for mounting / advanced use)": "*Opzionalmente* installa [FUSE](#install-fuse) (per funzionalità avanzate: montare IPFS come file system)",
    "Then run:": "Poi esegui:",
    "This will download ipfs and its dependencies, and compile `ipfs`.": "Questo scaricherà IPFS e le sue dipendenze, e compilerà `ipfs`.",
    "Note: If you're new to Go, you'll need to do a few things to make sure you setup your `PATH` and your `GOPATH` (the location Go looks for libraries):": "Nota: se non sei familiare con Go, dovrai fare un paio di cose per assicurarti che il tuo `PATH` e `GOPATH` (la posizione in cui Go cerca le sue librerie) siano a posto:",
    "Create a folder. e.g. `mkdir ~/go`": "Crea una cartella, ad esempio `mkdir ~/go`",
    "Add the following to your shell config file": "Aggiungi questo al tuo file di configurazione della shell:",
    "Troubleshooting": "Risoluzione dei problemi",
    "Help!": "Aiuto!",
    "If you have any problems, come get live help at\n[#ipfs](../#community) or via [the mailing list](../#community).": [
        "Se hai qualche problema, chiedici su",
        "[#ipfs](../#community) o usando la [mailing list](../#community)."
    ],
    "Check Go Version": "Controlla la versione di Go",
    "IPFS works with Go 1.5+.\nTo check what go version you have installed, type `go version`.\nHere's what I get:": [
        "IPFS funziona con Go 1.5+.",
        "Per controllare che versione di go hai installato, lancia `go version`.",
        "Ecco il mio output:"
    ],
    "If you need to update, it is recommended to install from the\n[canonical Go packages](https://golang.org/doc/install/).\nPackage managers often contain out-of-date Go packages.": [
        "Se hai bisogno di aggiornare, è consigliato installare dai [pacchetti distribuiti da Go](https://golang.org/doc/install/).",
        "I package manager contengono spesso pacchetti vecchi."
    ],
    "Install FUSE": "Installa FUSE",
    "For more details on setting up FUSE (so that you can mount the filesystem), see [github.com/ipfs/go-ipfs/blob/master/docs/fuse.md](https://github.com/ipfs/go-ipfs/blob/master/docs/fuse.md)": "Per altri dettagli riguardo le impostazioni di FUSE (per montare il filesystem), vedi [github.com/ipfs/go-ipfs/blob/master/docs/fuse.md](https://github.com/ipfs/go-ipfs/blob/master/docs/fuse.md)",
    "IPFS is The Permanent Web": "IPFS è il Web Permanente",
    "A new peer-to-peer hypermedia protocol": "Un nuovo protocollo peer-to-peer di ipermedia",
    "Watch Demo": "Guarda la demo",
    "The IPFS Project": "Il progetto IPFS",
    "The InterPlanetary File System (IPFS) is a new hypermedia distribution protocol, addressed by content and\nidentities. IPFS enables the creation of completely distributed applications.\nIt aims to make the web faster, safer, and more open.": [
        "The InterPlanetary File System (IPFS) è un nuovo protocollo di distrubuzione di ipermedia, dove gli oggetti sono indirizzati per il loro contenuto e identità.",
        "IPFS permette la creazione di applicazioni completamente distribuite.",
        "IPFS punta a rendere il web piu veloce, sicuro e libero."
    ],
    "IPFS is an open source project developed by the team at\n[Interplanetary Networks](http://ipn.io) and many contributors\nfrom the open source community.": [
        "IPFS è un progetto open source sviluppato da [Interplanetary Networks](http://ipn.io) e tanti contribuenti",
        "dalla comunità open source."
    ],
    "How it works": "Come funziona",
    "IPFS is a peer-to-peer distributed\nfile system that seeks to connect all computing devices\nwith the same system of files. In some ways, IPFS\nis similar to the Web, but IPFS could be seen as a single\nBitTorrent swarm, exchanging objects within one Git\nrepository. In other words, IPFS provides a high throughput\ncontent-addressed block storage model, with content-addressed\nhyperlinks. This forms a generalized Merkle\nDAG, a data structure upon which one can build versioned\nfile systems, blockchains, and even a Permanent Web. IPFS\ncombines a distributed hashtable, an incentivized block exchange,\nand a self-certifying namespace. IPFS has no single\npoint of failure, and nodes do not need to trust each other.": [
        "IPFS è un file system peer-to-peer distribuito che mira a collegare tutti i computer",
        "con lo stesso sistema di file. In un certo senso, IPFS",
        "è simile al Web, ma IPFS può essere visto come un singolo",
        "flusso BitTorrent, che permette dis cambiare oggetti in una repository Git.",
        "In altre parole, IPFS offre un block storage ad alto throughput con collegamenti ipertestuali indirizzati per contenuto.",
        "Questo è implementato usando un Merkle DAG, una struttura dati su cui è possibile costruire",
        "file system con controllod i versione, blockchains, e anche un Web Permanente.",
        "IPFS combina una distributed hashtable, un block exchange incentivato,",
        "e un namespace autocertificante. IPFS non ha un singolo",
        "punto di fallimento e i nodi non necessitano di fidarsi l'uno dell'altro."
    ],
    "Watch the Demo": "Guarda la demo",
    "Read the Paper": "Leggi la tesi",
    "IPFS Alpha Demo": "Demo Alpha di IPFS",
    "Install IPFS Alpha": "Installa IPFS Alpha",
    "Why We Must Distribute The Web": "Perchè dobbiamo distribuire il Web",
    "IPFS Overview": "Panoramica su IPFS",
    "This is the original IPFS overview.": "Questa è la panoramica originale su IPFS",
    "An updated overview will be published soon.": "Una panoramica più aggiornata verrà pubblicata a breve.",
    "Websites": "Siti Web",
    "Except as <a href=\"http://ipn.io/legal/policies\">noted</a>, content licensed <a href=\"https://creativecommons.org/licenses/by/3.0/\">CC-BY 3.0</a>.": "Contenuto su licenza <a href=\"https://creativecommons.org/licenses/by/3.0/\">CC-BY 3.0</a> tranne <a href=\"http://ipn.io/legal/policies\">dove diversamente specificato</a>.",
    "Then, unzip the archive, and move `ipfs` somewhere in your `$PATH`:": "Quindi, decomprimi l'archivio, e sposta `ipfs` nel tuo `$PATH`:",
    "These are trivial little JS \"apps\" deployed through IPFS.\nThey are simple utilities that demonstrate how one might\nbuild js applications and deploy them through ipfs.": [
        "Questi sono piccoli JS \"apps\" distribuiti attraverso IPFS.",
        "Sono semplici utility che dimostrano come si possa",
        "creare applicazioni JS e distribuirli attraverso IPFS."
    ],
    "Interplanetary Networks, Inc.": "Interplanetary Networks, Inc.",
    "These are a combination of `<transport address=\"\">/ipfs/<hash-of-public-key>`.</hash-of-public-key></transport>": "Queste sono una combinazione di `<indirizzo di trasporto>/ipfs/<impronta-della-chiave-pubblica>`.",
    "etc.": "ecc.",
    "IPFS is a new peer-to-peer hypermedia protocol.": "IPFS è un nuovo protocollo peer-to-peer di ipermedia"
}
